app/views/devise/registrations/edit.html.erb

      <%= form_with model: @user, local: true, url: "/users/avater_update"  do |form| %>
        <% @user = User.find(current_user.id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]