app/channels/room_channel.rb

  def speak(data)
    if data["message"] == "" || current_user.admin?
      return false
    end
    room = Room.find params[:room_id]
    chat_post = room.chat_posts.create(message: data["message"], user_id: current_user.id)
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "chat_posts" ("message", "user_id", "created_at", "updated_at", "room_id") VALUES (?, ?, ?, ?, ?)  [["message", "こんにちわ"], ["user_id", 2], ["created_at", "2020-07-28 07:59:37.821042"], ["updated_at", "2020-07-28 07:59:37.821042"], ["room_id", 1]]