app/views/rooms/_post.html.erb

UPDATE "chat_posts" SET see = 1 WHERE "chat_posts"."user_id" != ? AND "chat_posts"."room_id" = ?  [["user_id", 2], ["room_id", 1]]
---
        <span class="message my"><%= post.message %></span>
        <p class="chat_time my"><%= post.updated_at.strftime("%Y-%m-%d %H:%M")%></p>