app/views/posts/index.html.erb

              <div class="post-index-counts-contents-box">
                <p class="post-index-count-text">購入数 : <%= post.post_payments.count %></p>
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC