app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def new
    # @post = Post.new
    @post = Post.find(params[:post_id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def create
    @post = Post.find(params[:comment][:post_id])