app/controllers/posts_controller.rb

UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "tests"], ["updated_at", "2020-07-28 10:27:10.480715"], ["id", 10]]
---
  def update
    # @post = Post.find_by(id: params[:id])　のコードは private以下に記述していてbefore_action で渡しています。
    @post.content = params[:content]
    @post.save