app/controllers/posts_controller.rb

  def show
    @post = Post.find_by(id: params[:id])
    @user = @post.user
    @comments = Comment.all
    @comments_count = Comment.where(post_id: @post.id).count
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 19]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 19]]

  def create
    @post = Post.new(user_id: current_user.id,content: params[:content])
    @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "ken"], ["created_at", "2020-07-31 07:58:00.858697"], ["updated_at", "2020-07-31 07:58:00.858697"], ["user_id", 1]]