app/controllers/rooms_controller.rb

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "chat_posts".* FROM "chat_posts" WHERE "chat_posts"."room_id" = ?  [["room_id", 1]]
UPDATE "chat_posts" SET see = 1 WHERE "chat_posts"."user_id" != ? AND "chat_posts"."room_id" = ?  [["user_id", 2], ["room_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    if @room = Room.find(params[:id])
      @posts = @room.chat_posts
      @room_userid = UserRoom.where(:room_id => params[:id]).to_a
      ChatPost.where.not(:user_id => @room_userid[0].user_id).where(:room_id => params[:id]).update_all("see = 1")
      @this_user = User.find(@room_userid[0].user_id)

INSERT INTO "user_rooms" ("user_id", "room_id", "created_at", "updated_at", "to_user_id") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["room_id", 1], ["created_at", "2020-07-28 07:59:08.763446"], ["updated_at", "2020-07-28 07:59:08.763446"], ["to_user_id", 1]]
---
  def create
    @room = Room.new
    @room.save