app/controllers/users_controller.rb

SELECT  "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."room_id" = ? ORDER BY "user_rooms"."id" ASC LIMIT ?  [["room_id", 1], ["LIMIT", 1000]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "chat_posts" WHERE "chat_posts"."room_id" = ?  [["room_id", 1]]
---
  def get_to_user(user_id, room_id)
    create_user_id = nil
    ret = nil
    UserRoom.where(room_id: room_id).find_each do | user_room |
      create_user_id = user_room.user_id
      if user_room.user_id == current_user.id
        ret = User.where(id: user_room.to_user_id).first
      else
        ret = User.where(id: user_room.user_id).first
      end
    end

    # 相手が部屋を作成した(user_rooms.user_id(部屋作成者)が相手) かつ メッセージが来ていない場合（chat_posts0件）はnilを返す（メッセージ一覧非表示）
    if create_user_id != current_user.id and ChatPost.where(room_id: room_id).count == 0

SELECT COUNT(*) FROM "chat_posts" WHERE "chat_posts"."user_id" != ? AND "chat_posts"."see" = ? AND "chat_posts"."room_id" = ?  [["user_id", 1], ["see", 0], ["room_id", 1]]
---
  def non_count(user_id, room_id)
    ChatPost.where.not(:user_id => user_id).where(:see => 0).where(:room_id => room_id).count

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "user_rooms"."id" FROM "user_rooms" WHERE "user_rooms"."user_id" != ?  [["user_id", 1]]
SELECT  "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."user_id" IN (?, ?) AND "user_rooms"."to_user_id" IN (?, ?) ORDER BY "user_rooms"."id" ASC LIMIT ?  [["user_id", 1], ["user_id", 1], ["to_user_id", 1], ["to_user_id", 1], ["LIMIT", 1]]
SELECT  "user_rooms".* FROM "user_rooms" WHERE ("user_rooms"."user_id" = ? OR "user_rooms"."to_user_id" = ?) ORDER BY "user_rooms"."id" ASC LIMIT ?  [["user_id", 1], ["to_user_id", 1], ["LIMIT", 1000]]
SELECT COUNT(*) FROM "chat_posts" WHERE "chat_posts"."user_id" != ? AND "chat_posts"."see" = ? AND "chat_posts"."room_id" = ?  [["user_id", 2], ["see", 0], ["room_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @room = Room.new
    @rooms = current_user.rooms
    @nonrooms = Room.where(id: UserRoom.where.not(user_id: current_user.id).pluck(:id))
    ids = [params[:id], current_user.id]
    @create_room = UserRoom.where(:user_id => ids).where(:to_user_id => ids).first
    @user_room_rels_count = 0
    user_room_rels = UserRoom.where(:user_id => current_user.id).or(UserRoom.where(:to_user_id => current_user.id))
    user_room_rels.find_each do | user_room_rel |
      @user_room_rels_count += ChatPost.where.not(:user_id => current_user.id).where(:see => 0).where(:room_id => user_room_rel.room_id).count

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show_following
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show_follower
    @user = User.find(params[:id])

SELECT  "user_rooms".* FROM "user_rooms" WHERE ("user_rooms"."user_id" = ? OR "user_rooms"."to_user_id" = ?) ORDER BY "user_rooms"."id" ASC LIMIT ?  [["user_id", 1], ["to_user_id", 1], ["LIMIT", 1000]]
SELECT "rooms".* FROM "rooms" WHERE 1=0
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ?  [["id", 1]]
---
  def chat_index
    # @to_users = nil
    room_ids = []
    room_rels = UserRoom.where(user_id: current_user.id).or(UserRoom.where(to_user_id: current_user.id)).find_each do | room_rel |
      unless room_ids.include?(room_rel.room_id)
        room_ids.push(room_rel.room_id)
      end
      # if room_rel.user_id == current_user.id
      #   ids.push(room_rel.to_user_id)
      # else
      #   ids.push(room_rel.user_id)
      # end
    end
    @rooms = Room.where(:id => room_ids)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def avater_update
    if params[:user] and avater = params[:user][:avater]
      @user = User.find(current_user.id)

UPDATE "users" SET "updated_at" = ? WHERE "users"."id" = ?  [["updated_at", "2020-07-30 04:16:59.952534"], ["id", 1]]
---
  def bank_update
    if params[:user]
      @user = User.find(current_user.id)
      @user.update(bank_name: params[:user][:bank_name], bank_branch_name: params[:user][:bank_branch_name], bank_account_type: params[:user][:bank_account_type], bank_account_number: params[:user][:bank_account_number], bank_account_horseman_name_kana: params[:user][:bank_account_horseman_name_kana])