app/models/comment.rb

  def post
     return Post.find_by(id: self.post_id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" IS NULL LIMIT ?  [["LIMIT", 1]]